; domain
(define (domain satellite)
  (:requirements :strips :equality :typing :fluents)

  (:types satellite direction instrument mode)

  (:predicates 
    (on_board ?i - instrument ?s - satellite)
    (supports ?i - instrument ?m - mode)
    (pointing ?s - satellite ?d - direction)
    (power_avail ?s - satellite)
    (power_on ?i - instrument)
    (calibrated ?i - instrument)
    (have_image ?d - direction ?m - mode)
    (calibration_target ?i - instrument ?d - direction))

  (:functions 
    (fuel ?s - satellite)           ;; Nivel de combustible actual
    (fuel-used)                     ;; Métrica global de consumo
  )

  ;; Acción 1: Girar el satélite (Consume 10 unidades de combustible)
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev) 
                      (not (= ?d_new ?d_prev))
                      (>= (fuel ?s) 10)) ;; Verificación de recurso
   :effect (and (pointing ?s ?d_new) 
                (not (pointing ?s ?d_prev))
                (decrease (fuel ?s) 10)  ;; Gasto de combustible
                (increase (fuel-used) 10)))

  ;; Acción 2: Encender instrumento
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) (power_avail ?s))
   :effect (and (power_on ?i) (not (power_avail ?s))))

  ;; Acción 3: Apagar instrumento
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) (power_on ?i))
   :effect (and (not (power_on ?i)) (power_avail ?s)))

  ;; Acción 4: Calibrar instrumento (Consume 2 unidades de combustible)
  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s) 
                      (pointing ?s ?d) 
                      (calibration_target ?i ?d) 
                      (power_on ?i)
                      (>= (fuel ?s) 2))
   :effect (and (calibrated ?i)
                (decrease (fuel ?s) 2)
                (increase (fuel-used) 2)))

  ;; Acción 5: Tomar imagen
  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i) 
                      (on_board ?i ?s) 
                      (supports ?i ?m) 
                      (power_on ?i) 
                      (pointing ?s ?d))
   :effect (have_image ?d ?m))
)

; problem
(define (problem strips-sat-x-10)
(:domain satellite)
(:objects
	satellite0 satellite1 satellite2 satellite3 satellite4 - satellite
	instrument0 instrument1 instrument2 instrument3 instrument4 - instrument
	image1 spectrograph2 thermograph0 - mode
	GroundStation2 GroundStation1 GroundStation0 - direction
	Star3 Star4 Star5 Phenomenon6 Star7 Phenomenon8 Planet9 Planet10 
	Planet11 Phenomenon12 Phenomenon13 Star14 Star15 Phenomenon16 
	Planet17 Planet18 Star19 Star20 Phenomenon21 Phenomenon22 
	Planet23 Planet24 - direction
)
(:init
    ;; --- Configuración Satélite 0 ---
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star15)
    (= (fuel satellite0) 500)

    ;; --- Configuración Satélite 1 ---
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star19)
    (= (fuel satellite1) 500)

    ;; --- Configuración Satélite 2 ---
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
    (= (fuel satellite2) 500)

    ;; --- Configuración Satélite 3 ---
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
    (= (fuel satellite3) 500)

    ;; --- Configuración Satélite 4 ---
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet17)
    (= (fuel satellite4) 500)

    ;; --- Métrica Global ---
    (= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star5)
	(have_image Star5 spectrograph2)
	(have_image Phenomenon6 thermograph0)
	(have_image Star7 spectrograph2)
	(have_image Phenomenon8 spectrograph2)
	(have_image Planet9 spectrograph2)
	(have_image Planet10 spectrograph2)
	(have_image Planet11 image1)
	(have_image Phenomenon12 spectrograph2)
	(have_image Phenomenon13 thermograph0)
	(have_image Star14 thermograph0)
	(have_image Star15 image1)
	(have_image Phenomenon16 thermograph0)
	(have_image Planet17 image1)
	(have_image Planet18 spectrograph2)
))

;; --- Métrica de Optimización ---
;; El objetivo es minimizar el combustible total para maximizar la vida útil de la flota.
(:metric minimize (fuel-used))
)

; plan
1. (switch_on instrument4 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument4)
   goals met: 0 of 15
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 15
3. (calibrate satellite2 instrument2 groundstation1)
   added: (calibrated instrument2)
   changed: (fuel satellite2) from 500 to 498, (fuel-used) from 0 to 2
   goals met: 0 of 15
4. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 15
5. (turn_to satellite4 groundstation1 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 groundstation1)
   changed: (fuel satellite4) from 500 to 490, (fuel-used) from 2 to 12
   goals met: 0 of 15
6. (calibrate satellite4 instrument4 groundstation1)
   added: (calibrated instrument4)
   changed: (fuel satellite4) from 490 to 488, (fuel-used) from 12 to 14
   goals met: 0 of 15
7. (turn_to satellite4 phenomenon13 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon13)
   changed: (fuel satellite4) from 488 to 478, (fuel-used) from 14 to 24
   goals met: 0 of 15
8. (take_image satellite4 phenomenon13 instrument4 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 1 of 15
9. (turn_to satellite4 phenomenon16 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 phenomenon16)
   changed: (fuel satellite4) from 478 to 468, (fuel-used) from 24 to 34
   goals met: 1 of 15
10. (take_image satellite4 phenomenon16 instrument4 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 2 of 15
11. (turn_to satellite4 phenomenon6 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 phenomenon6)
   changed: (fuel satellite4) from 468 to 458, (fuel-used) from 34 to 44
   goals met: 2 of 15
12. (take_image satellite4 phenomenon6 instrument4 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   goals met: 3 of 15
13. (turn_to satellite4 star14 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 star14)
   changed: (fuel satellite4) from 458 to 448, (fuel-used) from 44 to 54
   goals met: 3 of 15
14. (take_image satellite4 star14 instrument4 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 4 of 15
15. (turn_to satellite2 phenomenon12 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon12)
   changed: (fuel satellite2) from 498 to 488, (fuel-used) from 54 to 64
   goals met: 4 of 15
16. (take_image satellite2 phenomenon12 instrument2 spectrograph2)
   added: (have_image phenomenon12 spectrograph2)
   goals met: 5 of 15
17. (turn_to satellite2 phenomenon8 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 488 to 478, (fuel-used) from 64 to 74
   goals met: 5 of 15
18. (take_image satellite2 phenomenon8 instrument2 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   goals met: 6 of 15
19. (turn_to satellite2 planet10 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 planet10)
   changed: (fuel satellite2) from 478 to 468, (fuel-used) from 74 to 84
   goals met: 6 of 15
20. (take_image satellite2 planet10 instrument2 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 7 of 15
21. (turn_to satellite2 planet18 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 planet18)
   changed: (fuel satellite2) from 468 to 458, (fuel-used) from 84 to 94
   goals met: 7 of 15
22. (take_image satellite2 planet18 instrument2 spectrograph2)
   added: (have_image planet18 spectrograph2)
   goals met: 8 of 15
23. (turn_to satellite2 planet9 planet18)
   deleted: (pointing satellite2 planet18)
   added: (pointing satellite2 planet9)
   changed: (fuel satellite2) from 458 to 448, (fuel-used) from 94 to 104
   goals met: 8 of 15
24. (take_image satellite2 planet9 instrument2 spectrograph2)
   added: (have_image planet9 spectrograph2)
   goals met: 9 of 15
25. (turn_to satellite2 star5 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star5)
   changed: (fuel satellite2) from 448 to 438, (fuel-used) from 104 to 114
   goals met: 9 of 15
26. (take_image satellite2 star5 instrument2 spectrograph2)
   added: (have_image star5 spectrograph2)
   goals met: 10 of 15
27. (turn_to satellite2 star7 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star7)
   changed: (fuel satellite2) from 438 to 428, (fuel-used) from 114 to 124
   goals met: 10 of 15
28. (take_image satellite2 star7 instrument2 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 11 of 15
29. (turn_to satellite1 groundstation2 star19)
   deleted: (pointing satellite1 star19)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 500 to 490, (fuel-used) from 124 to 134
   goals met: 11 of 15
30. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   changed: (fuel satellite1) from 490 to 488, (fuel-used) from 134 to 136
   goals met: 11 of 15
31. (turn_to satellite1 planet11 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet11)
   changed: (fuel satellite1) from 488 to 478, (fuel-used) from 136 to 146
   goals met: 11 of 15
32. (take_image satellite1 planet11 instrument1 image1)
   added: (have_image planet11 image1)
   goals met: 12 of 15
33. (turn_to satellite1 planet17 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet17)
   changed: (fuel satellite1) from 478 to 468, (fuel-used) from 146 to 156
   goals met: 12 of 15
34. (take_image satellite1 planet17 instrument1 image1)
   added: (have_image planet17 image1)
   goals met: 13 of 15
35. (turn_to satellite1 star15 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 star15)
   changed: (fuel satellite1) from 468 to 458, (fuel-used) from 156 to 166
   goals met: 13 of 15
36. (take_image satellite1 star15 instrument1 image1)
   added: (have_image star15 image1)
   goals met: 14 of 15
37. (turn_to satellite0 star5 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 500 to 490, (fuel-used) from 166 to 176
   goals met: 15 of 15
